app/controllers/articles_controller.rb

INSERT INTO "articles" ("author", "title", "journal", "year", "tags", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["author", "Jeesus"], ["title", "Armo"], ["journal", "Kristityt"], ["year", 23], ["tags", ""], ["created_at", "2016-05-03 11:58:13.115820"], ["updated_at", "2016-05-03 11:58:13.115820"]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "tags" = ?, "volume" = ?, "number" = ?, "pages" = ?, "month" = ?, "note" = ?, "akey" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["tags", "kissat"], ["volume", ""], ["number", ""], ["pages", ""], ["month", ""], ["note", ""], ["akey", ""], ["updated_at", "2016-05-03 13:55:49.624434"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)