app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("author", "title", "publisher", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["author", "HupsuNimi"], ["title", "KirjanNimi"], ["publisher", "Julkaisija"], ["year", 1999], ["created_at", "2016-04-19 12:28:29.848650"], ["updated_at", "2016-04-19 12:28:29.848650"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "tags" = ?, "volume" = ?, "series" = ?, "address" = ?, "edition" = ?, "month" = ?, "note" = ?, "bkey" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["tags", "algorithm"], ["volume", ""], ["series", ""], ["address", ""], ["edition", ""], ["month", ""], ["note", ""], ["bkey", ""], ["updated_at", "2016-05-03 13:55:49.978537"], ["id", 1]]