app/controllers/inproceedings_controller.rb

SELECT "inproceedings".* FROM "inproceedings"
---
  def index
    @inproceedings = Inproceeding.all

INSERT INTO "inproceedings" ("author", "title", "year", "booktitle", "tags", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["author", "Koira"], ["title", "Kevät"], ["year", "1765"], ["booktitle", "Vuodenajat"], ["tags", ""], ["created_at", "2016-05-03 11:58:13.797706"], ["updated_at", "2016-05-03 11:58:13.797706"]]
---
  def create
    @inproceeding = Inproceeding.new(inproceeding_params)

    respond_to do |format|
      if @inproceeding.save

UPDATE "inproceedings" SET "tags" = ?, "editor" = ?, "pages" = ?, "organization" = ?, "publisher" = ?, "address" = ?, "month" = ?, "note" = ?, "ikey" = ?, "updated_at" = ? WHERE "inproceedings"."id" = ?
---
  def update
    respond_to do |format|
      if @inproceeding.update(inproceeding_params)

DELETE FROM "inproceedings" WHERE "inproceedings"."id" = ?  [["id", 1]]
---
  def destroy
    @inproceeding.destroy

SELECT  "inproceedings".* FROM "inproceedings" WHERE "inproceedings"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_inproceeding
      @inproceeding = Inproceeding.find(params[:id])