app/controllers/references_controller.rb

SELECT "articles".* FROM "articles"
SELECT "books".* FROM "books"
SELECT "inproceedings".* FROM "inproceedings"
---
  def index
    @references = Article.all + Book.all + Inproceeding.all