app/controllers/search_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    @books = Book.all
    @articles = Article.all